app/Controllers/Login.php

    public function cek()
    {
        //    print_r($_POST);

        $username = $this->request->getPost('email-username');
        $pass = $this->request->getPost('password');

        $user = new LoginModel();
        $dataUser = $user->find($username);
---
SELECT *
FROM `tb_login`
WHERE `tb_login`.`username` = 'admin'