app/Models/MahasiswaModel.php

    public function getAllData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_mahasiswa');
        return $builder->get()->getResult();
---
SELECT *
FROM `tb_mahasiswa`