app/Models/PerkuliahanModel.php

    public function getPerkuliahanWithRelations()
    {
        return $this
            ->select('tb_perkuliahan.*, tb_mahasiswa.nama_mhs, tb_matakuliah.nama_mk, tb_dosen.nama_dosen')
            ->join('tb_mahasiswa', 'tb_mahasiswa.nim = tb_perkuliahan.nim')
            ->join('tb_matakuliah', 'tb_matakuliah.kode_mk = tb_perkuliahan.kode_mk')
            ->join('tb_dosen', 'tb_dosen.nip = tb_perkuliahan.nip')
            ->findAll();
---
SELECT `tb_perkuliahan`.*, `tb_mahasiswa`.`nama_mhs`, `tb_matakuliah`.`nama_mk`, `tb_dosen`.`nama_dosen`
FROM `tb_perkuliahan`
JOIN `tb_mahasiswa` ON `tb_mahasiswa`.`nim` = `tb_perkuliahan`.`nim`
JOIN `tb_matakuliah` ON `tb_matakuliah`.`kode_mk` = `tb_perkuliahan`.`kode_mk`
JOIN `tb_dosen` ON `tb_dosen`.`nip` = `tb_perkuliahan`.`nip`

    public function getMahasiswaData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_mahasiswa');
        return $builder->get()->getResult();
---
SELECT *
FROM `tb_mahasiswa`

    public function getMatakuliahData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_matakuliah');
        return $builder->get()->getResult();
---
SELECT *
FROM `tb_matakuliah`

    public function getDosenData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_dosen');
        return $builder->get()->getResult();
---
SELECT *
FROM `tb_dosen`